<script setup lang="ts">
import img from "assets/image/teachers/course/img.png";
import shapeMove from "~/composables/shapeMove.client";
const route = useRoute()
const router = useRouter()
const breadcrumb = {
  title: " نمایش دوره های آموزشی",
  breadcrumb: [
    {
      name: 'دوره های آموزشی'
    }
  ]
}
const sort = [
  {
    name:"همه دوره ها"
  },
  {
    name:"نوزاد"
  },
  {
    name:"مهدکودک"
  },
  {
    name:"پیش دبستان"
  },
  {
    name:"دبستان"
  },
]
const courses = [
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
  {
    img: img,
    time: '15 هفته',
    level: 'مبتدی',
    score: 3.5,
    title: 'سئو رو به عنوان کسب و کار خانگی شروع کنید',
    price: '35000',
    course: {
      count: 5
    },
    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    students: {
      count: 70
    },
  },
]

function changeRoute(){
  //تابعی که قراره درخواست بزنه و روت رو عوض کنه
}
watch(()=>route.query , ()=>{
  changeRoute()
})
onMounted(()=>{
shapeMove()
})
</script>

<template>
<div>
  <header>
    <breadcrumb-header-title :data="breadcrumb"/>
  </header>
  <main class=" w-[92%] sm:w-[95%] lg:w-1/2 mx-auto flex flex-col gap-7 mt-10">
    <nav class="grid grid-cols-3 items-center gap-4 sm:gap-0 ">
      <section class=" col-span-3 sm:col-span-1">
        <div class="input-group relative flex items-center ">
          <button class="absolute left-0 top-[50%] transform -translate-y-[50%] me-2 flex items-center"><i class="fa-solid fa-search fa-sm md:fa-xl text-gray-400" /></button>
          <input placeholder="اسم دوره مورد نظر را وارد کنید..." type="text" class="w-full border rounded py-0.5 md:py-1.5 px-3 outline-0 focus:border-blue-400 placeholder:text-sm">
        </div>
      </section>
      <section class="flex gap-5 justify-between sm:justify-end col-span-3 sm:col-span-2 filter">
        <div v-for="(item , index) in sort" :key="index">
          <nuxt-link :to="{name:'courses' ,query:{sort:item.name} }" class="font-bold">{{item.name}}</nuxt-link>
        </div>
      </section>
    </nav>
    <article class="grid grid-cols-12 gap-5 lg:gap-10">
        <cards-teachers-course v-for="(item , index) in courses" :key="index" class="col-span-12 sm:col-span-6 lg:col-span-4 mx-auto" :data="item" data-aos="fade-up" />
    </article>
  </main>
</div>
</template>

<style scoped lang="scss">
.filter{
  font-size: var(--text-md);
  @media screen and (max-width: 768px){
    font-size: var(--text-sm);
  }
}
input{
  &::placeholder{
    font-size: var(--text-md);
  }
}
</style>
